// frontend/src/data/employeeData.js
export const employeeData = [
  {
    รหัสพนักงาน: '241303',
    ชื่อ: 'รัขนก',
    นามสกุล: 'ราชรามทอง',
    แผนก: 'IT & DM',
    พื้นที่5ส: '5ส ณ บางปูใหม่',
    พื้นที่จัดทำโครงการ: 'IT',
    สิทธิ์: 'User',
  },
  {
    รหัสพนักงาน: '251307',
    ชื่อ: 'ภัณฑิรา',
    นามสกุล: 'ศรีพิมพ์เมือง',
    แผนก: 'IT & DM',
    พื้นที่5ส: '5ส ณ บางปูใหม่',
    พื้นที่จัดทำโครงการ: 'IT',
    สิทธิ์: 'Supervisor',
  },
  {
    รหัสพนักงาน: '1003',
    ชื่อ: 'วิชัย',
    นามสกุล: 'มีสุข',
    แผนก: 'PC',
    พื้นที่5ส: 'กลุ่มวางแผนการผลิต',
    พื้นที่จัดทำโครงการ: 'ออฟฟิศฝ่ายวางแผน',
    สิทธิ์: 'Admin',
  },
]; 