// frontend/src/data/employeeData.js
export const employeeData = [
  {
    รหัสพนักงาน: '241303',
    ชื่อ: 'สมชาย',
    นามสกุล: 'ใจดี',
    แผนก: 'HR & AD',
    พื้นที่5ส: '5ส ณ บางปูใหม่',
    พื้นที่จัดทำโครงการ: 'HR',
    สิทธิ์: 'User',
  },
  {
    รหัสพนักงาน: '251307',
    ชื่อ: 'ภัณฑิรา',
    นามสกุล: 'ศรีพิมพ์เมือง',
    แผนก: 'IT & DM',
    พื้นที่5ส: '5ส ณ บางปูใหม่',
    พื้นที่จัดทำโครงการ: 'IT',
    สิทธิ์: 'Supervisor',
  },
  {
    รหัสพนักงาน: '261401',
    ชื่อ: 'มนตรี',
    นามสกุล: 'ธนวัฒน์',
    แผนก: 'PD',
    พื้นที่5ส: '5ส ณ บางปูใหม่',
    พื้นที่จัดทำโครงการ: 'Production',
    สิทธิ์: 'Manager',
  },
  {
    รหัสพนักงาน: 'admin',
    ชื่อ: 'admin',
    นามสกุล: 'admin',
    แผนก: 'Admin',
    พื้นที่5ส: 'กลุ่มวางแผนการผลิต',
    พื้นที่จัดทำโครงการ: 'ออฟฟิศฝ่ายวางแผน',
    สิทธิ์: 'Admin',
  },
]; 